# StructuralSectionSigmaProfile Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionSigmaProfile Class
Members See Also
---
Defines parameters for Sigma Profile structural section.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class StructuralSectionSigmaProfile : StructuralSectionColdFormed
```

Visual Basic
---
```text
Public Class StructuralSectionSigmaProfile _
	Inherits StructuralSectionColdFormed
```

Visual C++
---
```text
public ref class StructuralSectionSigmaProfile : public StructuralSectionColdFormed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSection Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionRectangular Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionColdFormed Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionSigmaProfile
# See Also
StructuralSectionSigmaProfile Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace